In [2]:
import pandas as pd
df=pd.read_csv("miniQuiz.csv")
display(df.head())

   id     name  age         city  score
0   1    Alice   28     New York     85
1   2      Bob   35  Los Angeles     90
2   3  Charlie   22      Chicago     75
3   4    David   29      Houston     88
4   5      Eva   31      Phoenix     92

In [6]:
df1 = df.loc[[2, 3], ['name', 'age', 'city']]
print(df1)

      name  age     city
2  Charlie   22  Chicago
3    David   29  Houston

In [7]:
df2 = df.iloc[2:4, 1:4]
print(df2)

      name  age     city
2  Charlie   22  Chicago
3    David   29  Houston